In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [3]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [4]:
df.loc[0] = ["Allen", 22, 175]

In [5]:
df

    Name  Age  Height
0  Allen   22     175

In [6]:
df.loc[1] = ["Ted", 28, 180]
df.loc[1] = ("Ted", 28, 180)
df

    Name  Age  Height
0  Allen   22     175
1    Ted   28     180

In [7]:
df["Weight"] = [75, 80]
df

    Name  Age  Height  Weight
0  Allen   22     175      75
1    Ted   28     180      80

In [9]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  Allen   22     175
1    Ted   28     180

In [10]:
df

    Name  Age  Height  Weight
0  Allen   22     175      75
1    Ted   28     180      80

In [11]:
df = df.drop("Weight", axis=1)
df

    Name  Age  Height
0  Allen   22     175
1    Ted   28     180

In [12]:
df.drop(1)

    Name  Age  Height
0  Allen   22     175

In [13]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   28     180

In [14]:
df = df.drop(1)
df

    Name  Age  Height
0  Allen   22     175

In [15]:
df2 = pd.DataFrame(
    data=[
        ("Allen", 22, 175),
        ("Ted", 25, 180),
        ("Jack", 28, 177),
    ],
    columns=["Name", "Age", "Height"],
)

df2

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177